Vulintus/Vulintus_Board_Definitions/hardware/samd/0.1.0/boards.txt
vulintus_omnitrak_controller_v2_0.menu.cache.on=Enabled
vulintus_omnitrak_controller_v2_0.menu.cache.on.build.cache_flags=-DENABLE_CACHE
vulintus_omnitrak_controller_v2_0.menu.cache.off=Disabled
vulintus_omnitrak_controller_v2_0.menu.cache.off.build.cache_flags=
vulintus_omnitrak_controller_v2_0.menu.speed.120=120 MHz (standard)
vulintus_omnitrak_controller_v2_0.menu.speed.120.build.f_cpu=120000000L
vulintus_omnitrak_controller_v2_0.menu.speed.150=150 MHz (overclock)
vulintus_omnitrak_controller_v2_0.menu.speed.150.build.f_cpu=150000000L
vulintus_omnitrak_controller_v2_0.menu.speed.180=180 MHz (overclock)
vulintus_omnitrak_controller_v2_0.menu.speed.180.build.f_cpu=180000000L
vulintus_omnitrak_controller_v2_0.menu.speed.200=200 MHz (overclock)
vulintus_omnitrak_controller_v2_0.menu.speed.200.build.f_cpu=200000000L
vulintus_omnitrak_controller_v2_0.menu.opt.small=Small (-Os) (standard)
vulintus_omnitrak_controller_v2_0.menu.opt.small.build.flags.optimize=-Os
vulintus_omnitrak_controller_v2_0.menu.opt.fast=Fast (-O2)
vulintus_omnitrak_controller_v2_0.menu.opt.fast.build.flags.optimize=-O2
vulintus_omnitrak_controller_v2_0.menu.opt.faster=Faster (-O3)
vulintus_omnitrak_controller_v2_0.menu.opt.faster.build.flags.optimize=-O3
vulintus_omnitrak_controller_v2_0.menu.opt.fastest=Fastest (-Ofast)
vulintus_omnitrak_controller_v2_0.menu.opt.fastest.build.flags.optimize=-Ofast
vulintus_omnitrak_controller_v2_0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
vulintus_omnitrak_controller_v2_0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
vulintus_omnitrak_controller_v2_0.menu.usbstack.arduino=Arduino
vulintus_omnitrak_controller_v2_0.menu.usbstack.tinyusb=TinyUSB
vulintus_omnitrak_controller_v2_0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
vulintus_omnitrak_controller_v2_0.menu.debug.off=Off
vulintus_omnitrak_controller_v2_0.menu.debug.on=On
vulintus_omnitrak_controller_v2_0.menu.debug.on.build.flags.debug=-g

##############################################################
# Vulintus Linear Autopositioner V2.0 (SAMD21G17A)
# ------------------------------

vulintus_linear_autopositioner_v2_0.name=Vulintus Linear Autopositioner V2.0 (SAMD21G17A)

# VID/PID for Bootloader, Arduino & CircuitPython
vulintus_linear_autopositioner_v2_0.vid.0=0x239A
vulintus_linear_autopositioner_v2_0.pid.0=0x8013
vulintus_linear_autopositioner_v2_0.vid.1=0x239A
vulintus_linear_autopositioner_v2_0.pid.1=0x0013

# Upload
vulintus_linear_autopositioner_v2_0.upload.tool=bossac18
vulintus_linear_autopositioner_v2_0.upload.protocol=sam-ba
vulintus_linear_autopositioner_v2_0.upload.maximum_size=122880
vulintus_linear_autopositioner_v2_0.upload.offset=0x2000
vulintus_linear_autopositioner_v2_0.upload.use_1200bps_touch=true
vulintus_linear_autopositioner_v2_0.upload.wait_for_upload_port=true
vulintus_linear_autopositioner_v2_0.upload.native_usb=true

# Build
vulintus_linear_autopositioner_v2_0.build.mcu=cortex-m0plus
vulintus_linear_autopositioner_v2_0.build.f_cpu=48000000L
vulintus_linear_autopositioner_v2_0.build.cache_flags=-DENABLE_CACHE
vulintus_linear_autopositioner_v2_0.build.flags.optimize=-Os
vulintus_linear_autopositioner_v2_0.build.usb_product="Vulintus Linear Autopositioner V2.0"
vulintus_linear_autopositioner_v2_0.build.usb_manufacturer="Vulintus Inc"
vulintus_linear_autopositioner_v2_0.build.board=LINEAR_AUTOPOSITIONER_V2_0
vulintus_linear_autopositioner_v2_0.build.core=arduino
vulintus_linear_autopositioner_v2_0.build.extra_flags=-D__SAMD21G17A__ -DVULINTUS_LINEAR_AUTOPOSITIONER_V2_0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
vulintus_linear_autopositioner_v2_0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vulintus_linear_autopositioner_v2_0.build.openocdscript=openocd_scripts/linear_autopositioner_v2_0.cfg
vulintus_linear_autopositioner_v2_0.build.variant=linear_autopositioner_v2_0
vulintus_linear_autopositioner_v2_0.build.variant_system_lib=
vulintus_linear_autopositioner_v2_0.build.vid=0x239A
vulintus_linear_autopositioner_v2_0.build.pid=0x8013

# Bootloader
vulintus_linear_autopositioner_v2_0.bootloader.tool=openocd
vulintus_linear_autopositioner_v2_0.bootloader.file=linear_autopositioner_v2_0/bootloader-linear_autopositioner_v2_0.bin

##############################################################
# Vulintus Liquid Dispenser V2.0 (SAMD21G17A)
# ------------------------------

vulintus_liquid_dispenser_v2_0.name=Vulintus Liquid Dispenser V2.0 (SAMD21G17A)

# VID/PID for Bootloader, Arduino & CircuitPython
vulintus_liquid_dispenser_v2_0.vid.0=0x2341
vulintus_liquid_dispenser_v2_0.pid.0=0x804d
vulintus_liquid_dispenser_v2_0.vid.1=0x2341
vulintus_liquid_dispenser_v2_0.pid.1=0x804d

# Upload
vulintus_liquid_dispenser_v2_0.upload.tool=bossac18
vulintus_liquid_dispenser_v2_0.upload.protocol=sam-ba
vulintus_liquid_dispenser_v2_0.upload.maximum_size=122880
vulintus_liquid_dispenser_v2_0.upload.maximum_data_size=16384
vulintus_liquid_dispenser_v2_0.upload.offset=0x2000
vulintus_liquid_dispenser_v2_0.upload.use_1200bps_touch=true
vulintus_liquid_dispenser_v2_0.upload.wait_for_upload_port=true
vulintus_liquid_dispenser_v2_0.upload.native_usb=true

# Build
vulintus_liquid_dispenser_v2_0.build.mcu=cortex-m0plus
vulintus_liquid_dispenser_v2_0.build.f_cpu=48000000L
vulintus_liquid_dispenser_v2_0.build.cache_flags=-DENABLE_CACHE
vulintus_liquid_dispenser_v2_0.build.flags.optimize=-Os
vulintus_liquid_dispenser_v2_0.build.usb_product="Vulintus Liquid Dispenser V2.0"
vulintus_liquid_dispenser_v2_0.build.usb_manufacturer="Vulintus Inc"
vulintus_liquid_dispenser_v2_0.build.board=LIQUID_DISPENSER_V2_0
vulintus_liquid_dispenser_v2_0.build.core=arduino
vulintus_liquid_dispenser_v2_0.build.extra_flags=-DCRYSTALLESS -D__SAMD21G17A__ -DVULINTUS_LIQUID_DISPENSER_V2_0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
vulintus_liquid_dispenser_v2_0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vulintus_liquid_dispenser_v2_0.build.openocdscript=openocd_scripts/liquid_dispenser_v2_0.cfg
vulintus_liquid_dispenser_v2_0.build.variant=liquid_dispenser_v2_0
vulintus_liquid_dispenser_v2_0.build.variant_system_lib=
vulintus_liquid_dispenser_v2_0.build.vid=0x2341
vulintus_liquid_dispenser_v2_0.build.pid=0x804d

# Bootloader
vulintus_linear_autopositioner_v2_0.bootloader.tool=openocd
vulintus_linear_autopositioner_v2_0.bootloader.file=liquid_dispenser_v2_0/samd21g17a_sam_ba.bin


########################################################################################################################
# Vulintus Cage Ring Light V2.0 (SAMD11C14A)
# ------------------------------

